ruby_backend/tft_team_builder/app/controllers/api/auth_controller.rb

    def register
      user = User.new(register_params)

      if user.save
---
INSERT INTO "users" ("email", "password_digest", "role", "display_name", "bio", "location", "avatar_url", "created_at", "updated_at") VALUES ('testeryouranma@test.com', '$2a$12$iXSBxMS8B9va/KTREH4QfO6v1EymuEgzSYaAKzu/Yal7lgDsVgFHK', 'user', 'tester', NULL, NULL, NULL, '2025-10-13 04:54:15.043264', '2025-10-13 04:54:15.043264') RETURNING "id"

    def login
      user = User.find_by(email: login_params[:email].to_s.downcase.strip)
---
SELECT "users".* FROM "users" WHERE "users"."email" = '512495375@qq.com' LIMIT 1