ruby_backend/tft_team_builder/app/controllers/api/base_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
---
    def find_user_from_token(token)
      payload = JsonWebToken.decode(token)
      return unless payload && payload["sub"]

      User.find_by(id: payload["sub"])