ruby_backend/tft_team_builder/app/controllers/api/champions_controller.rb

SELECT "champions".* FROM "champions" ORDER BY COALESCE(cost, tier, 0) ASC, "champions"."name" ASC
---
    def index
      champions = Champion.order(:tier, :name)
      render json: champions.map { |champion| serialize(champion) }