ruby_backend/tft_team_builder/app/controllers/api/champions_controller.rb

SELECT "champions".* FROM "champions" WHERE "champions"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
---
    def show
      champion = Champion.find_by(id: params[:id])