ruby_backend/tft_team_builder/app/controllers/api/favorites_controller.rb

SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = 5
SELECT "team_comps".* FROM "team_comps" WHERE "team_comps"."id" IN (559, 456)
---
    def index
      favorites = current_user.favorites.includes(team_comp: :user)
      team_comps = favorites.map(&:team_comp)

INSERT INTO "favorites" ("user_id", "team_comp_id", "created_at", "updated_at") VALUES (5, 536, '2025-11-14 00:14:53.397989', '2025-11-14 00:14:53.397989') RETURNING "id"
UPDATE "team_comps" SET "favorites_count" = COALESCE("favorites_count", 0) - 1 WHERE "team_comps"."id" = 536
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = 5 AND "favorites"."team_comp_id" = 536 LIMIT 1
---
    def create
      # Check if already favorited
      existing_favorite = current_user.favorites.find_by(team_comp: @team_comp)

      if existing_favorite
        # Already favorited, return success status with fresh count
        render json: {
          favorited: true,
          favoritesCount: @team_comp.reload.favorites_count
        }, status: :ok
        return
      end

      favorite = current_user.favorites.build(team_comp: @team_comp)

      if favorite.save
        render json: {
          favorited: true,
          favoritesCount: @team_comp.reload.favorites_count
        }, status: :created
      else
        render json: { error: favorite.errors.full_messages.join(', ') }, status: :unprocessable_entity

SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = 5 AND "favorites"."team_comp_id" = 536 LIMIT 1
DELETE FROM "favorites" WHERE "favorites"."id" = 1
---
    def destroy
      favorite = current_user.favorites.find_by(team_comp: @team_comp)

      if favorite
        favorite.destroy

SELECT "team_comps".* FROM "team_comps" WHERE "team_comps"."id" = 536 LIMIT 1
---
    def set_team_comp
      @team_comp = TeamComp.find(params[:id])