ruby_backend/tft_team_builder/app/controllers/api/likes_controller.rb

    def create
      # Check if already liked
      existing_like = current_user.likes.find_by(team_comp: @team_comp)

      if existing_like
        # Already liked, return success status with fresh count
        render json: {
          liked: true,
          likesCount: @team_comp.reload.likes_count
        }, status: :ok
        return
      end

      like = current_user.likes.build(team_comp: @team_comp)

      if like.save
---
INSERT INTO "likes" ("user_id", "team_comp_id", "created_at", "updated_at") VALUES (5, 536, '2025-11-14 00:14:51.833707', '2025-11-14 00:14:51.833707') RETURNING "id"
UPDATE "team_comps" SET "likes_count" = COALESCE("likes_count", 0) + 1 WHERE "team_comps"."id" = 536

    def set_team_comp
      @team_comp = TeamComp.find(params[:id])
---
SELECT "team_comps".* FROM "team_comps" WHERE "team_comps"."id" = 536 LIMIT 1