ruby_backend/tft_team_builder/app/controllers/api/profiles_controller.rb

    def update
      if current_user.update(profile_params)
---
UPDATE "users" SET "display_name" = 'testeryouranma', "bio" = '', "location" = '', "avatar_url" = '', "updated_at" = '2025-10-13 04:54:50.078183' WHERE "users"."id" = 3