ruby_backend/tft_team_builder/app/controllers/api/team_comps_controller.rb

    def create
      team_comp = TeamComp.new(team_comp_attributes)
      team_comp.user = current_user

      if team_comp.save
---
INSERT INTO "team_comps" ("name", "description", "champions", "created_at", "updated_at", "win_rate", "play_rate", "notes", "source") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

    def update
      if @team_comp.update(team_comp_attributes)
---
UPDATE "team_comps" SET "description" = $1, "updated_at" = $2, "win_rate" = $3, "play_rate" = $4 WHERE "team_comps"."id" = $5  [["description", "Updated"], ["updated_at", "2025-10-13 00:31:26.026187"], ["win_rate", nil], ["play_rate", nil], ["id", 980190962]]

    def recommendations
      include_ids = extract_card_ids
      include_names = Champion.for_set(requested_set).where(id: include_ids).pluck(:name)

      results = team_comp_scope.order(win_rate: :desc, created_at: :desc).map do |team_comp|
        names = team_comp.champion_names
        matches = (names & include_names)

        next if include_names.present? && matches.empty?
---
SELECT "champions"."name" FROM "champions" WHERE "champions"."id" = $1  [["id", 980190962]]
SELECT "champions".* FROM "champions" WHERE "champions"."name" IN ($1, $2) AND "champions"."name" IN ('Aatrox', 'Kayle') ORDER BY CASE WHEN "champions"."name" = 'Aatrox' THEN 1 WHEN "champions"."name" = 'Kayle' THEN 2 END ASC  [["name", "Aatrox"], ["name", "Kayle"]]

    def set_team_comp
      @team_comp = TeamComp.find_by(id: params[:id])
---
SELECT "team_comps".* FROM "team_comps" WHERE "team_comps"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]