ruby_backend/tft_team_builder/app/controllers/api/team_comps_controller.rb

    def index
      comps = TeamComp.order(win_rate: :desc, created_at: :desc)
      limit = params.fetch(:limit, 50).to_i.clamp(1, 100)
      comps = comps.limit(limit)

      render json: comps.map { |comp| serialize(comp, include_cards: include_cards?) }
---
SELECT "team_comps".* FROM "team_comps" ORDER BY "team_comps"."win_rate" DESC, "team_comps"."created_at" DESC LIMIT 6
SELECT "team_comps".* FROM "team_comps" ORDER BY "team_comps"."win_rate" DESC, "team_comps"."created_at" DESC LIMIT 50

    def recommendations
      include_ids = extract_card_ids
      include_names = Champion.where(id: include_ids).pluck(:name)

      results = TeamComp.order(win_rate: :desc, created_at: :desc).map do |team_comp|
        names = team_comp.champion_names
        matches = (names & include_names)

        next if include_names.present? && matches.empty?

        {
          team_comp:,
          matches:,
          match_ratio: include_names.present? ? matches.length.to_f / include_names.length : 0.0
        }
      end.compact

      if results.empty?
        fallback = TeamComp.order(win_rate: :desc, created_at: :desc).limit(10)
        render json: {
          requestedChampionIds: include_ids,
          teams: fallback.map { |team| serialize(team, meta: { matchCount: 0 }) }
        }
        return
      end

      sorted = results.sort_by { |entry| [-entry[:matches].length, -(entry[:team_comp].win_rate_value || 0.0)] }
      top = sorted.first(params.fetch(:limit, 10).to_i.clamp(1, 25))
---
SELECT "team_comps".* FROM "team_comps" ORDER BY "team_comps"."win_rate" DESC, "team_comps"."created_at" DESC

    def set_team_comp
      @team_comp = TeamComp.find_by(id: params[:id])
---
SELECT "team_comps".* FROM "team_comps" WHERE "team_comps"."id" = NULL LIMIT 1