ruby_backend/tft_team_builder/app/controllers/api/team_comps_controller.rb

    def create
      team_comp = TeamComp.new(team_comp_attributes)
      team_comp.user = current_user

      if team_comp.save
---
INSERT INTO "team_comps" ("name", "description", "champions", "created_at", "updated_at", "win_rate", "play_rate", "notes", "source", "set_identifier", "composition_key", "composition_hash", "size", "play_count", "win_count", "top4_count", "avg_placement", "top1_rate", "top2_rate", "top3_rate", "top4_rate", "raw_data", "user_id", "team_type") VALUES ('abc', '', 'Aatrox, Ezreal, Garen, Kalista, Kayle, Kennen, Lucian, Gnar', '2025-11-13 23:19:49.132042', '2025-11-13 23:19:49.132042', NULL, NULL, '', NULL, 'TFT15', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '{}', 5, 'user') RETURNING "id"

    def destroy
      @team_comp.destroy!
---
DELETE FROM "team_comps" WHERE "team_comps"."id" = 551

    def recommendations
      include_ids = extract_card_ids
      include_names = Champion.for_set(requested_set).where(id: include_ids).pluck(:name)

      results = team_comp_scope.order(win_rate: :desc, created_at: :desc).map do |team_comp|
        names = team_comp.champion_names
        matches = (names & include_names)

        next if include_names.present? && matches.empty?

        {
          team_comp:,
          matches:,
          match_ratio: include_names.present? ? matches.length.to_f / include_names.length : 0.0
        }
      end.compact

      if results.empty?
        fallback = TeamComp.order(win_rate: :desc, created_at: :desc).limit(10)
---
SELECT "champions"."name" FROM "champions" WHERE "champions"."id" IN (9, 8, 1)
SELECT "team_comps".* FROM "team_comps" ORDER BY "team_comps"."win_rate" DESC, "team_comps"."created_at" DESC

    def set_team_comp
      @team_comp = TeamComp.find_by(id: params[:id])
---
SELECT "team_comps".* FROM "team_comps" WHERE "team_comps"."id" = 551 LIMIT 1

    def team_comp_attributes
      permitted = params.require(:team_comp).permit(:name, :description, :notes, :source, :win_rate, :play_rate,
                                                    :set_identifier, champion_ids: [], champion_names: [], champions: [])

      names = Array(permitted.delete(:champion_names)).map(&:to_s)
      ids = Array(permitted.delete(:champion_ids)).map(&:to_i)
      names += Array(permitted.delete(:champions)).map(&:to_s)
      names += Champion.where(id: ids).pluck(:name)
---
SELECT "champions"."name" FROM "champions" WHERE "champions"."id" IN (1, 9, 8, 56, 18, 20, 21, 53, 27, 29)