ruby_backend/tft_team_builder/lib/services/importers/tft_data_importer.rb

    def purge_existing!
      TeamComp.where(set_identifier: set_identifier).delete_all
      Champion.where(set_identifier: set_identifier).delete_all
      Trait.where(set_identifier: set_identifier).delete_all
---
DELETE FROM "team_comps" WHERE "team_comps"."set_identifier" = 'TFT15'
DELETE FROM "champions" WHERE "champions"."set_identifier" = 'TFT15'
DELETE FROM "traits" WHERE "traits"."set_identifier" = 'TFT15'

    def import_traits
      log "Importing #{traits_payload.size} traits for #{set_identifier}"
      traits_payload.each do |trait|
        Trait.create!(
          api_id: trait.fetch("id"),
          name: trait.fetch("name"),
          image_full: File.join("tft-trait", trait.fetch("full")),
          image_sprite: trait["sprite"],
          image_x: trait["x"],
          image_y: trait["y"],
          image_w: trait["w"],
          image_h: trait["h"],
          set_identifier: set_identifier
        )
---
INSERT INTO "traits" ("api_id", "name", "image_full", "image_sprite", "image_x", "image_y", "image_w", "image_h", "created_at", "updated_at", "set_identifier") VALUES ('TFT15_Bastion', 'Bastion', 'tft-trait/Trait_Icon_9_Bastion.png', 'tft-trait0.png', 432, 48, 48, 48, '2025-11-13 22:47:52.143020', '2025-11-13 22:47:52.143020', 'TFT15') RETURNING "id"

    def import_champions
      log "Importing #{champions_payload.size} champions for #{set_identifier}"
      trait_map = champion_trait_mapping.index_by { |entry| entry["championId"] }

      champions_payload.each do |champ|
        Champion.create!(
          api_id: champ.fetch("id"),
          name: champ.fetch("name"),
          tier: champ["cost"],
          cost: champ["cost"],
          traits: format_trait_names(trait_map[champ["id"]]&.fetch("traits", [])),
          image_url: File.join("tft-champion", champ.fetch("full")),
          sprite_name: champ["sprite"],
          sprite_x: champ["x"],
          sprite_y: champ["y"],
          sprite_w: champ["w"],
          sprite_h: champ["h"],
          set_identifier: set_identifier
        )
---
INSERT INTO "champions" ("name", "tier", "traits", "image_url", "created_at", "updated_at", "sprite_name", "sprite_x", "sprite_y", "sprite_w", "sprite_h", "api_id", "cost", "set_identifier") VALUES ('Aatrox', 1, 'Mighty Mech / Juggernaut / Heavyweight', 'tft-champion/TFT15_Aatrox.TFT_Set15.png', '2025-11-13 22:47:52.185194', '2025-11-13 22:47:52.185194', 'tft-champion1.png', 288, 0, 48, 48, 'TFT15_Aatrox', 1, 'TFT15') RETURNING "id"

    def import_team_comps
      champion_lookup = Champion.where(set_identifier: set_identifier).index_by(&:api_id)
      trait_lookup = Trait.where(set_identifier: set_identifier).pluck(:api_id, :name).to_h
      total_games = composition_entries.sum { |(_, data)| data.fetch("count", 0).to_i }

      log "Importing #{composition_entries.size} compositions (#{total_games} total games)"
      imported = 0

      composition_entries.each do |composition_key, comp_data|
        champion_ids = parse_champion_ids(composition_key)
        champions = champion_ids.map { |cid| champion_lookup[cid] }
        next if champions.any?(&:nil?)

        names = champions.map(&:name)
        comp_hash = composition_hash(champion_ids)

        next if TeamComp.exists?(composition_hash: comp_hash)
---
SELECT "champions".* FROM "champions" WHERE "champions"."set_identifier" = 'TFT15'
SELECT "traits"."api_id", "traits"."name" FROM "traits" WHERE "traits"."set_identifier" = 'TFT15'
SELECT 1 AS one FROM "team_comps" WHERE "team_comps"."composition_hash" = 'e76e3bc8ba132d65f919497e948f2388' LIMIT 1

    def select_carry(names)
      return if names.empty?

      champion_costs = Champion.where(set_identifier: set_identifier, name: names).pluck(:name, :cost, :tier).to_h do |name, cost, tier|
---
SELECT "champions"."name", "champions"."cost", "champions"."tier" FROM "champions" WHERE "champions"."set_identifier" = 'TFT15' AND "champions"."name" IN ('Caitlyn', 'Ezreal', 'Garen', 'Jayce', 'Kobuko', 'Leona', 'Rakan', 'Yuumi')