ruby_backend/tft_team_builder/lib/tasks/tft_data_import.rake

SELECT COUNT(*) FROM "champions" WHERE "champions"."set_identifier" = 'TFT15'
SELECT COUNT(*) FROM "team_comps" WHERE "team_comps"."set_identifier" = 'TFT15'
SELECT COUNT(*) FROM "traits" WHERE "traits"."set_identifier" = 'TFT15'
---
  task import: :environment do
    set_identifier = ENV["SET"].presence || TeamComp::DEFAULT_SET_IDENTIFIER
    importer = Services::Importers::TftDataImporter.new(set_identifier:)
    importer.call

    puts "Imported #{Champion.where(set_identifier: set_identifier).count} champions, "\
         "#{Trait.where(set_identifier: set_identifier).count} traits, "\
         "#{TeamComp.where(set_identifier: set_identifier).count} team comps"