ruby_backend/tft_team_builder/app/controllers/champions_controller.rb

  def index
    # 从数据库中获取所有 Champion 记录，并按费用(tier)排序
    @champions = Champion.all.order(:tier)
---
SELECT "champions".* FROM "champions" ORDER BY "champions"."tier" ASC