ruby_backend/tft_team_builder/app/serializers/team_comp_serializer.rb

SELECT "champions".* FROM "champions" WHERE "champions"."name" IN ('Vel''Koz', 'Lux', 'Sona', 'Thresh', 'Syndra', 'Neeko') AND "champions"."name" IN ('Vel''Koz', 'Lux', 'Sona', 'Thresh', 'Syndra', 'Neeko') ORDER BY CASE WHEN "champions"."name" = 'Vel''Koz' THEN 1 WHEN "champions"."name" = 'Lux' THEN 2 WHEN "champions"."name" = 'Sona' THEN 3 WHEN "champions"."name" = 'Thresh' THEN 4 WHEN "champions"."name" = 'Syndra' THEN 5 WHEN "champions"."name" = 'Neeko' THEN 6 END ASC
SELECT "users".* FROM "users" WHERE "users"."id" = 5 LIMIT 1
SELECT 1 AS one FROM "likes" WHERE "likes"."team_comp_id" = 536 AND "likes"."user_id" = 5 LIMIT 1
SELECT 1 AS one FROM "favorites" WHERE "favorites"."team_comp_id" = 536 AND "favorites"."user_id" = 5 LIMIT 1
SELECT "champions".* FROM "champions" WHERE "champions"."set_identifier" = 'TFT15' AND "champions"."name" IN ('Aatrox', 'Ezreal', 'Garen', 'Kalista', 'Kayle', 'Kennen', 'Malphite', 'Naafiri', 'Lucian', 'Gnar') AND "champions"."name" IN ('Aatrox', 'Ezreal', 'Garen', 'Kalista', 'Kayle', 'Kennen', 'Malphite', 'Naafiri', 'Lucian', 'Gnar') ORDER BY CASE WHEN "champions"."name" = 'Aatrox' THEN 1 WHEN "champions"."name" = 'Ezreal' THEN 2 WHEN "champions"."name" = 'Garen' THEN 3 WHEN "champions"."name" = 'Kalista' THEN 4 WHEN "champions"."name" = 'Kayle' THEN 5 WHEN "champions"."name" = 'Kennen' THEN 6 WHEN "champions"."name" = 'Malphite' THEN 7 WHEN "champions"."name" = 'Naafiri' THEN 8 WHEN "champions"."name" = 'Lucian' THEN 9 WHEN "champions"."name" = 'Gnar' THEN 10 END ASC
---
  def as_json(_options = {})
    payload = {
      id: team_comp.id,
      set: team_comp.set_identifier,
      name: team_comp.name,
      description: team_comp.description,
      winRate: team_comp.win_rate_value,
      playRate: team_comp.play_rate_value,
      notes: team_comp.notes,
      source: team_comp.source,
      championNames: team_comp.champion_names,
      size: team_comp.size || team_comp.champion_names.length,
      championCount: team_comp.champion_names.length,
      isSystemTeam: team_comp.team_type == "system",
      userId: team_comp.user_id,
      userName: team_comp.user&.email&.split("@")&.first || team_comp.user&.email,
      likesCount: team_comp.likes_count,
      favoritesCount: team_comp.favorites_count,
      commentsCount: team_comp.comments_count,
      createdAt: team_comp.created_at,
      updatedAt: team_comp.updated_at
    }

    # Add user interaction status if current_user is provided
    if current_user
      # Use cached values if available (from controller preload), otherwise query
      if team_comp.instance_variable_defined?(:@is_liked_by_current_user)
        payload[:isLiked] = team_comp.instance_variable_get(:@is_liked_by_current_user)
      else
        payload[:isLiked] = team_comp.likes.exists?(user_id: current_user.id)